NREL6_Wind_Turbine/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers false;
    geometry
    {
        blade.stl
        {
            type triSurfaceMesh;
            name blade;
        }
/*
        box
        {
            type searchableBox;
            min (-0.5 -0.3 1.0);
            max (2.0 0.6 5.2);
            name refinedBox;
        }
*/
    }

    castellatedMeshControls
    {
        features
        (
        {
            file "bladess.eMesh";
            level 9;
        }
        {
            file "bladeps.eMesh";
            level 9;
        }
        {
            file "bladete.eMesh";
            level 10;
        }
        );
        refinementSurfaces
        {
            blade
            {
                level ( 7 7 );
            }
        }

        refinementRegions
        {
        /*
            refinedBox
            {
                mode inside;
                levels ((5 5));
            }
            */
        }

        locationInMesh ( -0.5 0.5 0.5 );
        maxLocalCells 1000000;
        maxGlobalCells 20000000;
        minRefinementCells 0;
        nCellsBetweenLevels 3;
        resolveFeatureAngle 1;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 50;
        nSmoothPatch 5;
        tolerance 5.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap false;
    }

    addLayersControls
    {
        layers
        {
            "blade.*"
            {nSurfaceLayers 6;}
        }

        relativeSizes true;
        expansionRatio 1.3;
        finalLayerThickness 0.4;
        minThickness 0.001;
        nGrow 0;
        featureAngle 270;
        slipFeatureAngle 60;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 60;
        maxBoundarySkewness 4;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality -1e30;
        minArea -1.0;
        minTwist 0.02;
        minDeterminant 0.01;
        minFaceWeight 0.03;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
